{
  "mushy_01": {
    "title": "Once upon a time...",
    "continent": "base",
    "on_start": {
      "grant_follower": {
        "type": "mushroom_baby",
        "name": "Mushy",
        "count_as_recruit": true
      },
      "grant_flags": [
        "spell_life_boost_enabled",
        "spell_strength_enabled"
      ],
      "recruit_only_types": [
        "mushroom_baby"
      ],
      "follower_cap_extra": 2,
      "start_message": "Cast Strength from your spellbook, then head out to the Forest and find some opponents."
    },
    "on_complete": {
      "clear_recruit_only": true,
      "follower_cap": 2
    },
    "summary_pre": "A tiny mushroom offers help but warns the forest is deadly.",
    "summary_active": "Use the 'Strength' spell to boost your stats temporariy.  Fight opponents in the forest, and recruit three mushroom babies then fuse them at the temple.",
    "summary_complete": "Quest complete.",
    "art_opponent": "mushroom_baby",
    "dialog": [
      "Hi there! I’m Mushy. Nice to meet you! You and I may be low-level now. If we head into the forest like this, we won’t stand much chance against the monsters we’d find.",
      "But I have a little secret. I can teach you a couple basic spells to boost our stats. They’ll use MP, and the effects wear off over time.",
      "Life Boost adds 10 HP to your max life, and Strength adds 10 points to both Attack and Defense.",
      "Let me break it down: these effects cost MP to cast, and they stack. With a few casts, you’ll be strong enough to trample some monsters.",
      "Stat boosts won’t carry into the next day, so if you rest at the Inn, the effects reset. Resting also fully restores your HP and MP, so the next day you can recast the spells and power up before heading out again.",
      "If you take me with you, I’ll teach you these two spells and we can take down some enemies together. They’ll reward us with XP and GP. While battling, we can also recruit two more baby mushrooms using the “Socialize” feature. Once you have three baby mushrooms on the team, the priestess at the temple can merge us into a stronger Mushroom.",
      "So what do you say? Let me join you, and let’s see how we fare against real monsters."
    ],
    "requirements": {
      "flags_required": [],
      "level_min": 1
    },
    "objectives": [
      {
        "type": "fuse_followers",
        "follower_type": "mushroom_baby",
        "count": 3
      }
    ],
    "rewards": {
      "flags_set": [
        "quest_mushy_01_complete"
      ],
      "items": [],
      "xp": 100
    }
  },
  "mushy_02": {
    "title": "Wandcraft",
    "continent": "base",
    "summary_pre": "The alchemist can fuse gear into stronger forms.",
    "summary_active": "Buy 3 Oak Wands and fuse them into 1 by visiting the Alchemist.",
    "summary_complete": "Quest complete.",
    "art_opponent": "mushroom_baby",
    "dialog": [
      "Now that you know a few basic spells, let's talk about wands.  Spells normally consume your Mana Points (MP) to cast.  Mana will refresh each day (after sleeping at the Inn), but it is still limited.",
      "In addition to increasing the potency of your spells, wands can store charges, letting you cast spells without spending MP. To use a wand in battle, you must equip it so it is ready to use.",
      "Wands can be bought in the Shop, but the wands they sell here can only hold a single spell charge.  Luckily the Alchemist in town can fuse gear together to combine and increase its power.",
      "Buy 3 Oak Wands and fuse them into one at the Alchemist.  If you don't have enough GP yet, go hunting in the Forest."
    ],
    "requirements": {
      "flags_required": [
        "quest_mushy_01_complete"
      ]
    },
    "objectives": [
      {
        "type": "fuse_gear",
        "item_id": "oak_wand",
        "count": 3
      }
    ],
    "rewards": {
      "flags_set": [
        "quest_mushy_02_complete"
      ],
      "items": [],
      "xp": 100
    }
  },
  "mushy_03": {
    "title": "Gear up",
    "continent": "base",
    "summary_pre": "Mushy urges you to gear up before the next trials.",
    "summary_active": "Buy and equip one of each gear type.",
    "summary_complete": "Quest complete.",
    "art_opponent": "mushroom_teen",
    "dialog": [
      "Before we push further, we should gear up. You already have your wand, which gives you extra spell casts and increases your spell power, but there is more to adventuring than just magic.",
      "There are different kinds of items that you can equip to yourself to help boost different stats.",
      "Swords are good to raise your Attack power, shields and armor bolster Defense, and rings and bracelets can have different enchantments and bonuses.",
      "Visit the Shop to buy at leaet one of each different type of gear.  Purchased items will auto-equip to you, or you can browse under Options -> Inventory to change which items are equipped.",
      "If you don't have enough Gold to buy everything at this point, we can go hunting in the Forest to collect GP."
    ],
    "requirements": {
      "flags_required": [
        "quest_mushy_02_complete"
      ]
    },
    "objectives": [
      {
        "type": "equip_slots",
        "slots": [
          "sword",
          "shield",
          "armor",
          "ring",
          "bracelet",
          "wand"
        ],
        "count": 6
      }
    ],
    "rewards": {
      "flags_set": [
        "quest_mushy_03_complete"
      ],
      "items": [],
      "xp": 100
    }
  },
  "mushy_04": {
    "title": "Beba Hexa",
    "continent": "base",
    "on_start": {
      "grant_follower": {
        "type": "fairy_baby",
        "name": "Beba",
        "count_as_recruit": true
      },
      "gp_cost": 100,
      "recruit_only_types": [
        "fairy_baby"
      ],
      "follower_cap_extra": 2
    },
    "on_complete": {
      "clear_recruit_only": true,
      "follower_cap": 3
    },
    "summary_pre": "Mushy has a fairy friend who might grow into a queen.",
    "summary_active": "Recruit three fairy babies and fuse them into a fairy teen.",
    "summary_complete": "Quest complete.",
    "art_opponent": "fairy_baby",
    "dialog": [
      "Mushy has a friend to introduce. Her name is Beba, and she is tiny, sparkly, and very dramatic.",
      "She is not strong yet, but Beba is a princess. One day she could grow into a full Fairy Queen.",
      "Beba will cost 100 GP to recruit, but once she joins, other fairies will join for 60 GP each. It is worth it.",
      "If we help her gather a small court, she will blossom faster. That means recruiting a few fairy babies.",
      "Once we have three fairy babies, the temple can fuse them into a stronger fairy teen.",
      "Ready to meet Beba and give her a proper royal escort?"
    ],
    "requirements": {
      "flags_required": [
        "quest_mushy_03_complete"
      ]
    },
    "objectives": [
      {
        "type": "fuse_followers",
        "follower_type": "fairy_baby",
        "count": 3
      }
    ],
    "rewards": {
      "flags_set": [
        "quest_mushy_04_complete"
      ],
      "items": [],
      "xp": 100
    }
  },
  "mushy_05": {
    "title": "Chase the Moon",
    "continent": "base",
    "on_start": {
      "grant_follower": {
        "type": "wolf_pup",
        "name": "Chase",
        "count_as_recruit": true
      },
      "recruit_only_types": [
        "wolf_pup"
      ],
      "follower_cap_extra": 2
    },
    "on_complete": {
      "clear_recruit_only": true,
      "follower_cap": 3
    },
    "summary_pre": "A young wolf longs to run beneath the wandering tower’s shadow.",
    "summary_active": "Recruit three wolf pups and fuse them into a full wolf.",
    "summary_complete": "Quest complete.",
    "art_opponent": "wolf_pup",
    "dialog": [
      "Mushy whispers about a wolf pup named Chase who runs the ridge each night, following the moon’s path.",
      "Chase is quick but young, still learning to guard the pack. He wants a team that can keep up with him.",
      "If we help him gather two more wolf pups, the temple can fuse their bond into a full-grown wolf.",
      "A true wolf will give us the bite and grit to face what waits beyond the forest.",
      "Ready to run with Chase and learn the rhythm of the moon?"
    ],
    "requirements": {
      "flags_required": [
        "quest_mushy_04_complete"
      ],
      "level_min": 3
    },
    "objectives": [
      {
        "type": "fuse_followers",
        "follower_type": "wolf_pup",
        "count": 3
      }
    ],
    "rewards": {
      "flags_set": [
        "quest_mushy_05_complete"
      ],
      "items": [],
      "xp": 100
    }
  },
  "mushy_06": {
    "title": "Fight Sprites for Bites",
    "continent": "base",
    "on_start": {
      "grant_flags": [
        "mushy_06_trial_active"
      ],
      "start_message": "Defeat the four fairy warriors in the forest to earn Sprite's Bite."
    },
    "summary_pre": "Beba proposes a trial of strength against the forest fairies.",
    "summary_active": "Defeat the four fairies in the forest.",
    "summary_complete": "Quest complete.",
    "art_opponent": "fairy_baby",
    "dialog": [
      "We are really working well as a team so far, but it's time to push your magic skills to the next level.",
      "Besides the basic stat enhancing spells you currently have, there are powerful attack spells that can do damange directly to enemies.",
      "There are four fairy warriors nearby in the forrest, and if you are able to prove your strength to them, they will grant you a spell that allows you to call them into battle to inflict damage on your enemies.",
      "If you feel you are ready for this challenge, we can travel to the forest to do battle with them.  But be warned, these will be the hardest enemies you have faced up to this point."
    ],
    "requirements": {
      "flags_required": [
        "quest_mushy_05_complete"
      ],
      "level_min": 3
    },
    "objectives": [
      {
        "type": "visit_scene",
        "id": "mushy_06_trial"
      }
    ],
    "rewards": {
      "flags_set": [
        "quest_mushy_06_complete",
        "spell_sprite_bite_enabled"
      ],
      "items": [],
      "xp": 100
    }
  },
  "unlock_continent_01": {
    "title": "[PLACEHOLDER_TITLE]",
    "continent": "base",
    "summary_pre": "[PLACEHOLDER_SUMMARY_PRE]",
    "summary_active": "[PLACEHOLDER_SUMMARY_ACTIVE]",
    "summary_complete": "[PLACEHOLDER_SUMMARY_COMPLETE]",
    "art_opponent": "[PLACEHOLDER_OPPONENT_ID]",
    "dialog": [
      "[PLACEHOLDER_DIALOG_LINE_1]",
      "[PLACEHOLDER_DIALOG_LINE_2]"
    ],
    "requirements": {
      "flags_required": [
        "[PLACEHOLDER_FLAG_ID]"
      ]
    },
    "objectives": [
      {
        "type": "[PLACEHOLDER_OBJECTIVE_TYPE]",
        "id": "[PLACEHOLDER_OBJECTIVE_ID]",
        "count": 1
      }
    ],
    "rewards": {
      "flags_set": [
        "unlock_continent_[PLACEHOLDER_CONTINENT_ID]"
      ],
      "items": [],
      "xp": 100
    }
  }
}
